src/notes.org
#+TITLE: A Model C Framework for Membrane-Actin Systems
#+AUTHOR: Aakanksha
#+DATE: 9/16/24
#+LANGUAGE: en
#+LATEX_CLASS: custom
#+OPTIONS: html-postamble:nil
#+EXPORT_FILE_NAME: modelc

* Theory

** Model formulation

The grand free energy of the membrane-actin system is given by

\begin{align}
	F(\phi, \mathbf{Q}) = \int d\mathbf{r} \bigg\{ 
					& f_0(\phi) + f_1(\phi, \mathbf{Q}) + \alpha|\mathbf{Q}\cdot\nabla\phi|^2 \notag \\
					+& \frac{1}{2}\left[\kappa|\nabla\phi|^2 + L_1 (\partial_i Q_{jk})(\partial_i Q_{jk}) + L_2 (\partial_i Q_{ik})(\partial_j Q_{jk})\right] 
					\bigg\} \ ,
\end{align}

where the bulk free energy $\phi$ is the usual double-well potential,

\begin{equation}
  f_0(\phi) = \frac{\phi^4}{4} - \frac{\phi^2}{2} \ ,
\end{equation}

and the bulk free energy of $\mathbf{Q}$ comes from the Landau-de Gennes free energy,

\begin{equation}
	f_1(\phi, \mathbf{Q}) = \frac{\beta}{4}(\mathrm{Tr}(\mathbf{Q}^2))^2 - \left(\frac{1 + \phi}{2}\right)\mathrm{Tr}(\mathbf{Q}^2) \ .
\end{equation}

The $\phi$ field follows conserved dynamics:

\begin{equation}
  \frac{\partial \phi}{\partial t} = \gamma\nabla^2\frac{\delta F}{\delta \phi} \ ,
\end{equation}

where

\begin{equation}
  \frac{\delta F}{\delta \phi} = \phi^3 - \phi - \frac{1}{2}\mathrm{Tr}(\mathbf{Q}^2) - \nabla\cdot[1 + \chi\mathrm{Tr}(\mathbf{Q}^2)]\nabla\phi \ .
\end{equation}

The $\mathbf{Q}$ field follows non-conserved dynamics:

\begin{equation}
  \frac{\partial \mathbf{Q}}{\partial t} = -\frac{\delta F}{\delta \mathbf{Q}} \ ,
\end{equation}

where

\begin{equation}
  -\frac{\delta F}{\delta\mathbf{Q}} = [1 + \phi - 2\alpha|\nabla\phi|^2 - \beta \mathrm{Tr}(\mathbf{Q})^2]\mathbf{Q} + E_1 \nabla^2\mathbf{Q} + E_2\nabla(\nabla\cdot\mathbf{Q}) \ .
\end{equation}

Putting everything together, the final model is:

\begin{align}
	\frac{\partial \phi}{\partial t} &= \gamma\nabla^2[f^\prime_{eff} - \nabla\cdot(\kappa_{eff}\nabla\phi)] \ , \\
	\frac{\partial \mathbf{Q}}{\partial t} &= [1 + \phi - 2\chi|\nabla\phi|^2 - \beta\mathrm{Tr}(\mathbf{Q}^2)]\mathbf{Q} + E_1\nabla^2\mathbf{Q} + E_2\nabla(\nabla\cdot\mathbf{Q}) \ ,
\end{align}

where the effective bulk free energy is

\begin{equation}
	f^\prime_{eff} = \phi^3 - \phi - \frac{1}{2}\mathrm{Tr}(\mathbf{Q}^2) \ ,
\end{equation}

and the effective surface tension is

\begin{equation}
	\kappa_{eff} = 1 + \chi\mathrm{Tr}(\mathbf{Q}^2) = 
	\begin{cases}
   		1, & Q_{ij} = 0 \\
   		1 + 4\chi S^2, & Q_{ij} \neq 0
	\end{cases} \ .
\end{equation}

The length- and time-scales normalized by a characteristic scale, defined as $(l_c, t_c) = (\sqrt{\kappa}, \Gamma^{-1})$ in our problem. The non-dimensional parameters in the model are

\begin{align*}
	\gamma &= \frac{1/\Gamma}{\kappa/M} = \frac{\text{nematic timescale}}{\text{molecular timescale}} \ , \\
	\chi &= \frac{\alpha}{\kappa} = \frac{\text{anchoring strength}}{\text{surface tension}} \ , \\
	E_i &= \frac{L_i}{\kappa} = \frac{\text{elastic constants}}{\text{surface tension}} \ .
\end{align*}

** Linear stability

** Theory of domain growth for inhomogenous surface tension

* Numerics

* Computation

#+BEGIN_SRC python :results output :tangle ModelC.py
  import numpy as np
  import matplotlib.pyplot as plt
  import cupy as cp

  
#+END_SRC

* Results

** Finite size effects

** Understanding the parameters

** Varying actin density

*** Domain growth

*** Structure factor

*** Relaxation dynamics 

** Varying actin concentration

*** Domain growth

*** Structure factor

*** Relaxation dynamics

** Analyzing domain growth

** Analyzing structure

** Analyzing relxation
