src/modelc.tex
% Created 2024-09-16 Mon 14:55
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,11pt]{custom}
         \usepackage{amsmath}
         \usepackage{amssymb}
         \usepackage{graphicx}
         \usepackage{hyperref}
         \usepackage{lmodern}
         \renewcommand{\rmdefault}{lmr}
         \renewcommand{\sfdefault}{lmr}
         \usepackage{titlesec}
         \titleformat{\section}
         {\large\bfseries}
         {\thesection $|$}
         {0.1cm}
         {\ruleafter}
         \titleformat{\subsection}
         {}
         {\thesubsection}
         {0.1cm}
         {}
         \titlespacing*{\section}
         {0pt}{0.4cm}{0.4cm}
         \setlist{nosep}
         \setlist[itemize]{noitemsep, topsep=0pt}
         \hypersetup{
             colorlinks=true,
             allcolors=blue
         }
         
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[utf8]{inputenc}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{geometry}
\usepackage{bm}
\usepackage{xcolor}
\usepackage{geometry}
\usepackage[margin=1in]{geometry}
\usepackage{listings}
\usepackage{enumitem}
\usepackage{setspace}
\usepackage{lmodern}
\usepackage{fontenc}
\usepackage{caption}
\usepackage{hyperref}
\author{Aakanksha}
\date{9/16/24}
\title{A Model C Framework for Membrane-Actin Systems}
\hypersetup{
 pdfauthor={Aakanksha},
 pdftitle={A Model C Framework for Membrane-Actin Systems},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Theory}
\label{sec:org5f843ea}

\subsection{Model formulation}
\label{sec:org977bf25}

The grand free energy of the membrane-actin system is given by

\begin{align}
	F(\phi, \mathbf{Q}) = \int d\mathbf{r} \bigg\{ 
					& f_0(\phi) + f_1(\phi, \mathbf{Q}) + \alpha|\mathbf{Q}\cdot\nabla\phi|^2 \notag \\
					+& \frac{1}{2}\left[\kappa|\nabla\phi|^2 + L_1 (\partial_i Q_{jk})(\partial_i Q_{jk}) + L_2 (\partial_i Q_{ik})(\partial_j Q_{jk})\right] 
					\bigg\} \ ,
\end{align}

where the bulk free energy \(\phi\) is the usual double-well potential,

\begin{equation}
  f_0(\phi) = \frac{\phi^4}{4} - \frac{\phi^2}{2} \ ,
\end{equation}

and the bulk free energy of \(\mathbf{Q}\) comes from the Landau-de Gennes free energy,

\begin{equation}
	f_1(\phi, \mathbf{Q}) = \frac{\beta}{4}(\mathrm{Tr}(\mathbf{Q}^2))^2 - \left(\frac{1 + \phi}{2}\right)\mathrm{Tr}(\mathbf{Q}^2) \ .
\end{equation}

The \(\phi\) field follows conserved dynamics:

\begin{equation}
  \frac{\partial \phi}{\partial t} = \gamma\nabla^2\frac{\delta F}{\delta \phi} \ ,
\end{equation}

where

\begin{equation}
  \frac{\delta F}{\delta \phi} = \phi^3 - \phi - \frac{1}{2}\mathrm{Tr}(\mathbf{Q}^2) - \nabla\cdot[1 + \chi\mathrm{Tr}(\mathbf{Q}^2)]\nabla\phi \ .
\end{equation}

The \(\mathbf{Q}\) field follows non-conserved dynamics:

\begin{equation}
  \frac{\partial \mathbf{Q}}{\partial t} = -\frac{\delta F}{\delta \mathbf{Q}} \ ,
\end{equation}

where

\begin{equation}
  -\frac{\delta F}{\delta\mathbf{Q}} = [1 + \phi - 2\alpha|\nabla\phi|^2 - \beta \mathrm{Tr}(\mathbf{Q})^2]\mathbf{Q} + E_1 \nabla^2\mathbf{Q} + E_2\nabla(\nabla\cdot\mathbf{Q}) \ .
\end{equation}

Putting everything together, the final model is:

\begin{align}
	\frac{\partial \phi}{\partial t} &= \gamma\nabla^2[f^\prime_{eff} - \nabla\cdot(\kappa_{eff}\nabla\phi)] \ , \\
	\frac{\partial \mathbf{Q}}{\partial t} &= [1 + \phi - 2\chi|\nabla\phi|^2 - \beta\mathrm{Tr}(\mathbf{Q}^2)]\mathbf{Q} + E_1\nabla^2\mathbf{Q} + E_2\nabla(\nabla\cdot\mathbf{Q}) \ ,
\end{align}

where the effective bulk free energy is

\begin{equation}
	f^\prime_{eff} = \phi^3 - \phi - \frac{1}{2}\mathrm{Tr}(\mathbf{Q}^2) \ ,
\end{equation}

and the effective surface tension is

\begin{equation}
	\kappa_{eff} = 1 + \chi\mathrm{Tr}(\mathbf{Q}^2) = 
	\begin{cases}
   		1, & Q_{ij} = 0 \\
   		1 + 4\chi S^2, & Q_{ij} \neq 0
	\end{cases} \ .
\end{equation}

The length- and time-scales normalized by a characteristic scale, defined as \((l_c, t_c) = (\sqrt{\kappa}, \Gamma^{-1})\) in our problem. The non-dimensional parameters in the model are

\begin{align*}
	\gamma &= \frac{1/\Gamma}{\kappa/M} = \frac{\text{nematic timescale}}{\text{molecular timescale}} \ , \\
	\chi &= \frac{\alpha}{\kappa} = \frac{\text{anchoring strength}}{\text{surface tension}} \ , \\
	E_i &= \frac{L_i}{\kappa} = \frac{\text{elastic constants}}{\text{surface tension}} \ .
\end{align*}

\subsection{Linear stability}
\label{sec:org95de8c0}

\subsection{Theory of domain growth for inhomogenous surface tension}
\label{sec:orgf0b53b3}

\section{Numerics}
\label{sec:orgfcffd63}

\section{Computation}
\label{sec:org0c2e7d0}

\begin{verbatim}
import numpy as np
import matplotlib.pyplot as plt
import cupy as cp


\end{verbatim}

\section{Results}
\label{sec:orga1c6ad1}

\subsection{Finite size effects}
\label{sec:org5b956f8}

\subsection{Understanding the parameters}
\label{sec:org21e2d8d}

\subsection{Varying actin density}
\label{sec:org2427f1f}

\subsubsection{Domain growth}
\label{sec:orgcadea09}

\subsubsection{Structure factor}
\label{sec:org540078f}

\subsubsection{Relaxation dynamics}
\label{sec:orge4847ff}

\subsection{Varying actin concentration}
\label{sec:org11a16c7}

\subsubsection{Domain growth}
\label{sec:org8352486}

\subsubsection{Structure factor}
\label{sec:orgafb27db}

\subsubsection{Relaxation dynamics}
\label{sec:org2d9c04d}

\subsection{Analyzing domain growth}
\label{sec:org7d58f9d}

\subsection{Analyzing structure}
\label{sec:orge304e72}

\subsection{Analyzing relxation}
\label{sec:orgc396360}
\end{document}
